Revit 2027 API
StructuralConnectionHandler.IsDetailed Method
 Checks if Structural Connection Handler has the detailed connection style.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsDetailed()
Public Function IsDetailed As Boolean
public:
bool IsDetailed()
member IsDetailed : unit -> bool
Return Value
Boolean
 True if Structural Connection Handler has the detailed connection style.
See Also
Reference
StructuralConnectionHandler Class
Autodesk.Revit.DB.Structure Namespace